СМП_ОнлайнОбменДанными/cfe/src/Reports/СМП_СверкаДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СМП_СверкаДанныхОбмена</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМП_УчетныеЗаписиОбменов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПорции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Enums/СМП_НастройкиОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СМП_НастройкиОбменов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляПолучения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Reports/СМП_СверкаДанныхОбмена/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.НастройкаОбмена",
		Перечисления.СМП_НастройкиОбменов.ДляОтправки));
	Элементы.УчетнаяЗапись.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	Элементы.ТипДокумента.РежимВыбораИзСписка = Истина;

	Если Не ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
		Отчет.КонецПериода = КонецМесяца(Отчет.НачалоПериода);
	КонецЕсли;
	Если Отчет.РазмерПорции = 0 Тогда
		Отчет.РазмерПорции = 50;
	КонецЕсли;
	Если Отчет.Таймаут = 0 Тогда
		Отчет.Таймаут = 60;
	КонецЕсли;
	Отчет.ТолькоРасхождения = Истина;

	ЗаполнитьСписокТиповДокументов();

КонецПроцедуры

// Сохраненные настройки (обмен, тип документа, ...) загружаются после ПриСозданииНаСервере:
// список типов перезаполняется уже для сохраненного обмена.
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	ЗаполнитьСписокТиповДокументов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетнаяЗаписьПриИзменении(Элемент)

	ЗаполнитьСписокТиповДокументов();

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Документ = ДокументРасшифровки(Расшифровка);
	Если ЗначениеЗаполнено(Документ) Тогда
		ПоказатьЗначение(, Документ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()

	Результат.Очистить();
	АдресРасшифровки = "";

	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	Попытка
		ОтчетОбъект.СкомпоноватьРезультат(Результат, ДанныеРасшифровки);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;

	АдресРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТиповДокументов()

	СписокВыбора = Элементы.ТипДокумента.СписокВыбора;
	СписокВыбора.Очистить();

	Если ЗначениеЗаполнено(Отчет.УчетнаяЗапись) Тогда
		Для Каждого СтрокаТЧ Из Отчет.УчетнаяЗапись.ОбъектыКВыгрузке Цикл
			Представление = ?(ПустаяСтрока(СтрокаТЧ.Синоним), СтрокаТЧ.ПолноеИмяОбъекта, СтрокаТЧ.Синоним);
			СписокВыбора.Добавить(СтрокаТЧ.ПолноеИмяОбъекта, Представление);
		КонецЦикла;
	КонецЕсли;

	Если СписокВыбора.НайтиПоЗначению(Отчет.ТипДокумента) = Неопределено Тогда
		Отчет.ТипДокумента = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДокументРасшифровки(Расшифровка)

	Если ПустаяСтрока(АдресРасшифровки) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки);
	Элемент = ДанныеРасшифровки.Элементы[Расшифровка];
	Пока Элемент <> Неопределено Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Для Каждого Поле Из Элемент.ПолучитьПоля() Цикл
				Если Поле.Поле = "Документ" Тогда
					Возврат Поле.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Родители = Элемент.ПолучитьРодителей();
		Элемент = ?(Родители.Количество() > 0, Родители[0], Неопределено);
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

#КонецОбласти
